app/controllers/sessions_controller.rb

  def create
    # 登录系统，管理员->后台， 普通用户->操作台
    #  1. 用户id和用户名写入session中
    #  2. 登录信息写入日志表
    #
    user = User.find_by(name: params[:name],status: 1)
---
SELECT  "users".* FROM "users" WHERE "users"."name" = ? AND "users"."status" = ? LIMIT ?  [["name", "stud01"], ["status", "0"], ["LIMIT", 1]]